#! -*- coding:utf-8 -*-

#因为样本更趋向于多项分布 所以用朴素贝叶斯
from src import actionModel as am

# 测试
test_data = [
    '深入调查线索E',
    '深入调查',
    '看看我的线索',
    '让我看看我的线索',
    '调查漫画家',
    '调查',
    '搜索林教授',
    '开始投票吧',
    '投票',
    '再给我看看以前的线索'
]

test_data7 = [
    '看看林夺',
    '章乔的线索1条',
    '调查E',
    '看看线索',
    '查罗宇飞',
    '本轮结束',
    '深入调查',
    'E',
    '我的线索',
    '有的线索',
    '已经有的线索',
    '我想看吴有为的线索',
    '我想看孙云业的线索',
    '查陈兴元',
    '搜查林夺',
    '返回上一阶段',
    '下一阶段'
]

test_data2 = [
    '跳到下一轮',
    '下一轮搜证',
    '下一轮',
    '下一轮开始',
    '下个阶段',
    '开始',
    '上一阶段',
    '搜查结束',
    '下一阶段'

]


test_data3 = [
    '我投给jack，我觉得他是凶手',
    '投给lily',
    '选sam吧'
]



test_data4 = [
    '调查',
    '我要搜老板娘',
    '搜查',
    '调查',
    '搜索',
    '查'
]

test_data5 = [
    '是的',
    '好',
    '好了',
    '开始',
    '确定',
    '确认',
    '同意',
    '不',
    '别',
    '没',
    '不开始'
]

test_data6 = [
    '返回',
    '退回',
    '回到上一阶段',
    '上一阶段',
    '上个阶段',
    '退',
    '回到上个阶段',
    '回到上一阶段',
    '下一回合'
]



b = am.ActionModel()
for i in test_data4:
    print(i,'->',b.predictAction(i))
